_org/_posts/2017-05-25-single-server.org
#+TITLE:     Using Docker to Run Everything From a Single Server
#+AUTHOR:    Dashamir Hoxha
#+EMAIL:     dashohoxha@gmail.com
#+DATE:      2017-05-25
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
# #+INFOJS_OPT: view:overview toc:t ltoc:t mouse:#aadddd buttons:0 path:js/org-info.js
#+STYLE: <link rel="stylesheet" type="text/css" href="css/org-info.css" />
#+begin_comment yaml-front-matter
---
layout:     post
title:      Using Docker to Run Everything From a Single Server
date:       2017-05-25

summary: Often it is desirable to install several web pages or web applications
    in the same server, in order to minimize costs. However this is not so
    easy and presents some challenges.  We will discuss several ways of
    trying to accomplish it, and argue that using Docker is the most
    efficient and the most easy one. We will also see some use cases of
    applications that can be installed with Docker, which actually make
    use of some custom shell scripts that I have developed.
tags:       [linux docker server]
---
#+end_comment


* Abstract

Often it is desirable to install several web pages or web applications
in the same server, in order to minimize costs. However this is not so
easy and presents some challenges.  We will discuss several ways of
trying to accomplish it, and argue that using Docker is the most
efficient and the most easy one. We will also see some use cases of
applications that can be installed with Docker, which actually make
use of some custom shell scripts that I have developed.


* The Problem

Usually a small organization or institution has limited resources and
it makes sense to use them as efficiently as possible. For example
let's say they have a single server with public IP and would like to
install in it their website, several web applications,
etc. Traditionally this is done by installing all the applications and
their dependencies in the same place, and trying to fix their
configurations so that they coexist peacefully with each-other. We can
use the name-based virtual hosting of apache2 to host several
domains/subdomains on the same webserver.

However the issue is a little bit more complicated than this, because
sometimes it is not possible (or suitable, or convenient) to host two
different websites on the same server. For example, let's say that a
website is built on Joomla, and it has some modules that do not work
well with the latest version of PHP, so it depends on the previous
version of PHP. Now we have to install manually the previous version
of PHP and this makes the whole thing more difficult. Moreover, this
previous version of PHP is not suitable or may break the other
websites or applications, which require the latest version of PHP. So,
we will have to keep 2 parallel installations of PHP, each one for a
different version, and to configure each website or application for
using the right version.

This makes very high the complexity of installation, configuration and
maintenance. Sometimes it may even be impossible due to conflicting
dependencies. The only solution in this case would be to separate
these websites/applications into two different servers, one that has
the previous version of PHP and another with the latest one. But now
it is more expensive (because requires two or more servers, instead of
one). It also requires more than one public IP, one for each server,
which sometimes is more expensive, and sometimes is simply not
possible.


* Using an HTTP Reverse Proxy

In this case, the Reverse Proxy module of apache2 comes to rescue. The
idea is that the main webserver can forward the http requests to the
other webservers, behaving like a kind of http gateway or hub. So, we
need a public IP only for the proxy server and all the requests for
each of the hosted domains/subdomains go to it. Then it will use the
name-based virtual hosting feature of apache2 to distinguish between
them, and forward each of them to the appropriate internal server,
acting as a proxy between the webclient and the webserver.

The apache2 configuration on the proxy server looks like this:
#+begin_example
<VirtualHost *:80>
        ServerName site1.example.org
        ProxyPass / http://site1.example.org/
        ProxyPassReverse / http://site1.example.org/
        ProxyRequests off
</VirtualHost>
#+end_example
There is a section like this for each domain/subdomain that is hosted.

Now, the tricky part is to modify ~/etc/hosts~ and to add lines like
this for each supported domain/subdomain:
#+begin_example
192.168.1.115  site1.example.org
#+end_example
Here =192.168.1.115= is the internal IP of the webserver that hosts
the domain =site1.example.org=. Without this configuration apache2
would not know where to forward the request, the request would be sent
again to the proxy server itself, and this would create an endless
loop.

For handling HTTPS requests, the configuration of apache2 would look
like this:
#+begin_example
<VirtualHost _default_:443>
        ServerName site1.example.org
        ProxyPass / https://site1.example.org/
        ProxyPassReverse / https://site1.example.org/

        ProxyRequests off

        SSLEngine on
        SSLCertificateFile      /etc/ssl/certs/ssl-cert-snakeoil.pem
        SSLCertificateKeyFile   /etc/ssl/private/ssl-cert-snakeoil.key
        #SSLCertificateChainFile /etc/ssl/certs/ssl-cert-snakeoil.pem

        SSLProxyEngine on
        SSLProxyVerify none
        SSLProxyCheckPeerCN off
        SSLProxyCheckPeerName off
        SSLProxyCheckPeerExpire off
</VirtualHost>
#+end_example

Also these apache2 modules have to be enabled:
#+begin_example
a2enmod ssl proxy proxy_http proxy_connect proxy_balancer cache headers rewrite
#+end_example


