_posts/2017-05-25-single-server.html
---
layout:     post
title:      Using Docker to Run Everything From a Single Server
date:       2017-05-25

summary: Often it is desirable to install several web pages or web applications
    in the same server, in order to minimize costs. However this is not so
    easy and presents some challenges.  We will discuss several ways of
    trying to accomplish it, and argue that using Docker is the most
    efficient and the most easy one. We will also see some use cases of
    applications that can be installed with Docker, which actually make
    use of some custom shell scripts that I have developed.
tags:       [linux docker server]
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-02 Fri 14:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Docker to Run Everything From a Single Server</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">Using Docker to Run Everything From a Single Server</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Abstract</a></li>
<li><a href="#orgheadline2">2. The Problem</a></li>
<li><a href="#orgheadline3">3. Using an HTTP Reverse Proxy</a></li>
<li><a href="#orgheadline4">4. Using Virtual Machines</a></li>
<li><a href="#orgheadline5">5. Using Docker</a></li>
<li><a href="#orgheadline6">6. Implementing the Docker solution: WSProxy</a></li>
<li><a href="#orgheadline7">7. WSProxy: Serving a Remote Domain Through an SSH-Tunnel</a></li>
<li><a href="#orgheadline8">8. WSProxy: Managing the HTTPS Certificates</a></li>
<li><a href="#orgheadline9">9. Case Study 1: Installing Moodle</a></li>
<li><a href="#orgheadline10">10. Case Study 2: Installing ShellInBox</a></li>
<li><a href="#orgheadline11">11. Case Study 3: Installing SchoolTool</a></li>
<li><a href="#orgheadline12">12. Managing Your Own Domain Name Server</a></li>
<li><a href="#orgheadline13">13. IN      A               12.345.67.89</a></li>
<li><a href="#orgheadline14">14. Conclusion</a></li>
<li><a href="#orgheadline15">15. Future Work</a></li>
<li><a href="#orgheadline16">16. References</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
Often it is desirable to install several web pages or web applications
in the same server, in order to minimize costs. However this is not so
easy and presents some challenges.  We will discuss several ways of
trying to accomplish it, and argue that using Docker is the most
efficient and the most easy one. We will also see some use cases of
applications that can be installed with Docker, which actually make
use of some custom shell scripts that I have developed.
</p>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> The Problem</h2>
<div class="outline-text-2" id="text-2">
<p>
Usually a small organization or institution has limited resources and
it makes sense to use them as efficiently as possible. For example
let's say they have a single server with public IP and would like to
install in it their website, several web applications,
etc. Traditionally this is done by installing all the applications and
their dependencies in the same place, and trying to fix their
configurations so that they coexist peacefully with each-other. We can
use the name-based virtual hosting of apache2 to host several
domains/subdomains on the same webserver.
</p>

<p>
However the issue is a little bit more complicated than this, because
sometimes it is not possible (or suitable, or convenient) to host two
different websites on the same server. For example, let's say that a
website is built on Joomla, and it has some modules that do not work
well with the latest version of PHP, so it depends on the previous
version of PHP. Now we have to install manually the previous version
of PHP and this makes the whole thing more difficult. Moreover, this
previous version of PHP is not suitable or may break the other
websites or applications, which require the latest version of PHP. So,
we will have to keep 2 parallel installations of PHP, each one for a
different version, and to configure each website or application for
using the right version.
</p>

<p>
This makes very high the complexity of installation, configuration and
maintenance. Sometimes it may even be impossible due to conflicting
dependencies. The only solution in this case would be to separate
these websites/applications into two different servers, one that has
the previous version of PHP and another with the latest one. But now
it is more expensive (because requires two or more servers, instead of
one). It also requires more than one public IP, one for each server,
which sometimes is more expensive, and sometimes is simply not
possible.
</p>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Using an HTTP Reverse Proxy</h2>
<div class="outline-text-2" id="text-3">
<p>
In this case, the Reverse Proxy module of apache2 comes to rescue. The
idea is that the main webserver can forward the http requests to the
other webservers, behaving like a kind of http gateway or hub. So, we
need a public IP only for the proxy server and all the requests for
each of the hosted domains/subdomains go to it. Then it will use the
name-based virtual hosting feature of apache2 to distinguish between
them, and forward each of them to the appropriate internal server,
acting as a proxy between the webclient and the webserver.
</p>

<p>
The apache2 configuration on the proxy server looks like this:
</p>
<pre class="example">
&lt;VirtualHost *:80&gt;
        ServerName site1.example.org
        ProxyPass / http://site1.example.org/
        ProxyPassReverse / http://site1.example.org/
        ProxyRequests off
&lt;/VirtualHost&gt;
</pre>
<p>
There is a section like this for each domain/subdomain that is hosted.
</p>

<p>
Now, the tricky part is to modify <code>/etc/hosts</code> and to add lines like
this for each supported domain/subdomain:
</p>
<pre class="example">
192.168.1.115  site1.example.org
</pre>
<p>
Here <code>192.168.1.115</code> is the internal IP of the webserver that hosts
the domain <code>site1.example.org</code>. Without this configuration apache2
would not know where to forward the request, the request would be sent
again to the proxy server itself, and this would create an endless
loop.
</p>

<p>
For handling HTTPS requests, the configuration of apache2 would look
like this:
</p>
<pre class="example">
&lt;VirtualHost _default_:443&gt;
        ServerName site1.example.org
        ProxyPass / https://site1.example.org/
        ProxyPassReverse / https://site1.example.org/

        ProxyRequests off

        SSLEngine on
        SSLCertificateFile      /etc/ssl/certs/ssl-cert-snakeoil.pem
        SSLCertificateKeyFile   /etc/ssl/private/ssl-cert-snakeoil.key
        #SSLCertificateChainFile /etc/ssl/certs/ssl-cert-snakeoil.pem

        SSLProxyEngine on
        SSLProxyVerify none
        SSLProxyCheckPeerCN off
        SSLProxyCheckPeerName off
        SSLProxyCheckPeerExpire off
&lt;/VirtualHost&gt;
</pre>

<p>
Also these apache2 modules have to be enabled:
</p>
<pre class="example">
a2enmod ssl proxy proxy_http proxy_connect proxy_balancer cache headers rewrite
</pre>
</div>
</div>
