_posts/2017-05-25-single-server.html


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Using Virtual Machines</h2>
<div class="outline-text-2" id="text-4">
<p>
Instead of using a separate physical machine for the proxy server and
for each of the webservers, we can use virtual machines inside a
single physical machine. This brings some benefits in terms of
management and maintenance because it is easier to manage a virtual
machine than a physical one. For example you can make a snapshot of
the virtual machine (which is like a full backup of everything), you
can make a clone of it and use the clone for testing new
installations/configurations, you have more flexibility in increasing
or decreasing the resources of the virtual machine (for example
increasing the amount of RAM if needed), etc.
</p>

<p>
However, the machine that hosts the virtual servers has to be more
powerful than a normal server. It needs to have more RAM, more
processing power, faster storage, etc. because these resources are
divided among the virtual servers. For example, suppose that we need
to have 3 webservers, one for each website or webapp. We also need a
webproxy server, as discussed in the previous section, to handle the
http requests for all the domains.  If we assume that each webserver
needs at least 512MB of RAM to run properly, then for these 4 virtual
machines we need at least 2GB or RAM. The host system as well needs at
least 512MB of RAM to run properly, so in total we would need a
machine with at least 2-3 GB of RAM.
</p>

<p>
On the other hand, if we were able run all the websites and webapps on
the same server, without separating them into different machines, 1GB
of RAM would be more than enough for running everything properly.
This happens because each virtual machine has to spend resources for
running its own system, its own apache2 server etc. so in total they
need more resources than a single server.
</p>

<p>
Besides this, another problem is that once some resources are
allocated to a virtual machine they cannot be shared with the other
virtual machines, even if they are idle (unused). For example, suppose
that we allocate 512MB of RAM to virt-ws-1 and 512MB or RAM to
virt-ws-2. Let's also say that when virt-ws-1 is very busy virt-ws-2
is idle, and when virt-ws-1 is idle virt-ws-2 is very busy. Even
though one of them is idle, it cannot share its free resources (RAM)
with the busy one because the virtual machines and their allocated
resources are totally isolated from each-other. If both applications
were installed on the same server though, they would have been able to
use the whole 1GB available, while they are busy and the other one is
idle.
</p>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Using Docker</h2>
<div class="outline-text-2" id="text-5">
<p>
Docker is a tool that allows us to create and manage virtual machines.
However the virtual machines created by Docker are lightweight, they
use much less resources than the traditional virtual machines. This
comes from the fact that the virtual machines created by Docker can
share resources with the hosting system and between each-other. For
example, all the Docker virtual machines use the same kernel as the
hosting system, no need to use extra resources for running a separate
kernel for each virtual machine. Also, there are no limitations on the
amount of RAM that each Docker VM can use. If the hosting system has
2GB of RAM, this amount of RAM is available to all of the VMs and they
share it as needed. If one of the VMs is busy at a certain time and
the other ones are idle, then the one that is busy can go on and use
all the available free RAM, up to 2GB. Also, Docker VMs can easily
share the disk space, if needed, and there are no limits on the amount
of disk space that each one of them can use.
</p>

<p>
This ability of Docker for sharing resources among the virtual
machines provides a better and more efficient resource utilization.
So, Docker virtual machines can provide both isolation between
different applications, so that they are not affected by the
dependencies of each-other, and efficient utilization of the available
resources. As such, they are a perfect solution in many situations.
One of these situations is also our case of running several webservers
separated from each-other.
</p>

<p>
Besides all these, Docker VMs are also very easy to install and manage
and have full support for scripting and automation, making the life
easy for sysadmins. They are also highly configurable and resource
sharing among virtual machines can be made as restrictive or as
flexible as needed.
</p>
</div>
</div>


<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> Implementing the Docker solution: WSProxy</h2>
<div class="outline-text-2" id="text-6">
<p>
I have developed some scripts that automate the process of building
and maintaining a web server proxy with Docker. It is quite simple and
easy to install and to build a Docker container that does the job of a
web server proxy:
</p>
<pre class="example">
mkdir -p /opt/src
cd /opt/src/
git clone https://github.com/docker-build/wsproxy

mkdir -p /opt/workdir/wsproxy1
cd /opt/workdir/wsproxy1
ln -s /opt/src/wsproxy .

cp wsproxy/utils/config.sh .
vim config.sh

wsproxy/docker/build.sh
wsproxy/docker/create.sh

wsproxy/docker/start.sh
</pre>

<p>
So, we first get the code of the scripts from GitHub and save it on
<code>/opt/src/wsproxy</code>. Then we create a new directory for managing the
container, called <code>/opt/workdir/wsproxy1</code> and link the source
directory inside it. Then we copy and tweak the configuration file,
build the docker image, create the docker container, and then start
it.
</p>

<p>
Now let's say that we have two webservers, <i>webserver-1</i> and
<i>webserver-2</i>, each one running in a docker container. Later we will
see in more details how to create and start such webservers, but for
the time being let's say that they are created like this:
</p>
<pre class="example">
docker run -d --name=ws1 --hostname=site1.example.org webserver-1
docker run -d --name=ws2 --hostname=site2.example.org webserver-2
</pre>

<p>
Note that no HTTP ports are exposed to the host (for example using
options <code>-p 80:80 -p 443:443</code>), and this is important because the HTTP
ports are already being used by the <i>wsproxy</i> container.
</p>

<p>
Now we can fix the configuration of <i>wsproxy</i> so that it can serve
as a proxy for these domains, and we can do it like this:
</p>
<pre class="example">
wsproxy/domains-add.sh ws1 site1.example.org
wsproxy/domains-add.sh ws2 site2.example.org site3.example.org
</pre>

<p>
So, all the needed configurations are done by the script
<code>domains-add.sh</code> and we pass it as parameters the name of the
container that actually serves the domain and the name of the
domain. A container can also serve more than one domain, like <i>ws2</i>
which is serving the domains <code>site2.example.org</code> and
<code>site3.example.org</code> (it can do it using the name-based virtual hosting
of apache2, for example).
</p>

<p>
Now all the websites are served from the same server, but they are
isolated from each-other using docker containers, which make an
efficient usage of the server resources and are easy to maintain.
</p>
</div>
</div>
