_posts/2017-05-25-single-server.html


<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> WSProxy: Serving a Remote Domain Through an SSH-Tunnel</h2>
<div class="outline-text-2" id="text-7">
<p>
The web server proxy can also serve a domain that is installed on an
other machine. For example, let's say that the domain
<i>site4.example.org</i> is installed on another hosting server, which does
not have a public IP. Then we can use this command to tell <i>wsproxy</i>
to serve this domain as well:
</p>
<pre class="example">
wsproxy/sshtunnel-add.sh site4.example.org
</pre>

<p>
This command will adjust the configuration of <i>wsproxy</i> to serve this
domain and it will also create the script
<code>sshtunnel-keys/site4.example.org.sh</code>.  The script
<code>site4.example.org.sh</code> should be transferred to the server where this
domain is hosted and executed there. Once it is executed for the first
time, it will set up the remote server to connect to <i>wsproxy</i> and
establish a ssh tunnel.  The web server proxy can use this tunnel to
forward http(s) requests to the webserver. The scripts that are
installed on the webserver try also to test periodically the
established ssh tunnel and to re-establish it if broken.
</p>
</div>
</div>


<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> WSProxy: Managing the HTTPS Certificates</h2>
<div class="outline-text-2" id="text-8">
<p>
The scripts of <i>wsproxy</i> can also obtain free SSL certificates from letsencrypt
for the managed domains. It is as simple as this:
</p>
<pre class="example">
wsproxy/get-ssl-cert.sh user@gmail.com site1.example.org --test
wsproxy/get-ssl-cert.sh user@gmail.com site1.example.org
wsproxy/get-ssl-cert.sh user@gmail.com site2.example.org site3.example.org -t
wsproxy/get-ssl-cert.sh user@gmail.com site2.example.org site3.example.org
</pre>

<p>
In the first command we run the script in testing mode, to make sure
that everything works as expected. Then we remove the testing option
and get the certificate for the domain <i>site1.example.org</i>. The last
two commands are the same, but it shows that we can actually use the
same certificate for several domains. The email provided is that of
the maintainer of <i>wsproxy</i>. When the certificates are about to
expire, letsencrypt will send a warning to this email address so that
the certificates are renewed in time. However the script
<code>get-ssl-cert.sh</code> takes care to set up automatic renewal of the
certificates, so normally no manual intervention is needed in order to
renew them, unless something is wrong.
</p>
</div>
</div>


<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> Case Study 1: Installing Moodle</h2>
<div class="outline-text-2" id="text-9">
<p>
Moodle is a powerful learning platform that can be useful for
universities and schools. It is not difficult to install it on a web
server, however I have built some scripts for installing it in a
Docker container, which make its installation and configuration even
easier. They can be used like this:
</p>
<pre class="example">
mkdir -p /opt/src/
cd /opt/src/
git clone https://github.com/docker-build/moodle

mkdir -p /opt/workdir/moodle1.example.org
cd /opt/workdir/moodle1.example.org/

ln -s /opt/src/moodle .
cp moodle/utils/settings.sh .
vim settings.sh

moodle/docker/build.sh
moodle/docker/create.sh
moodle/docker/start.sh
moodle/config.sh
</pre>

<p>
First we get the code of the scripts from GitHub and save it on
<code>/opt/src/moodle</code>. Then we create a new directory for managing the
container, called <code>/opt/workdir/moodle1.example.org</code> and link the
source directory inside it. Then we copy and tweek the file
<code>settings.sh</code>.  Then we build the docker image, create the docker
container and start and configure it.
</p>

<p>
The file <code>settings.sh</code> should look like this:
</p>
<pre class="example">
### Docker settings.
IMAGE=moodle
CONTAINER=moodle1-example-org
#PORT_HTTP=80
#PORT_HTTPS=443
#PORT_SSH=2222

DOMAIN="moodle1.example.org"
[ . . . . . ]
</pre>

<p>
Notice that the http ports are commented out, so that the container
does not expose them. If this was a standalone installation then
normally we would expose these ports. However we are running
<i>moodle1-example-org</i> behind the <i>wsproxy</i>, so the http requests
should come from <i>wsproxy</i>. To tell <i>wsproxy</i> to forward the http
requests for this domain to the right container, we use these
commands:
</p>
<pre class="example">
cd /opt/workdir/wsproxy1/
wsproxy/domains-add.sh moodle1-example-org moodle1.example.org
</pre>

<p>
And while we are here, we also tell <i>wsproxy</i> to get and manage
a free "letsencrypt" SSL certificate for this domain:
</p>
<pre class="example">
wsproxy/get-ssl-cert.sh user@gmail.com moodle1.example.org -t
wsproxy/get-ssl-cert.sh user@gmail.com moodle1.example.org
</pre>

<p>
The installation/configuration is as easy as that, and now we can open
in browser <a href="https://moodle1.example.org/">https://moodle1.example.org/</a>
</p>
</div>
</div>


<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">10</span> Case Study 2: Installing ShellInBox</h2>
<div class="outline-text-2" id="text-10">
<p>
This is a tool that allows shell access to a server using a browser as
a terminal.  I use it to provide a shell access to my Linux students,
so that they can try the commands, do the homeworks, etc. Installing
it in a docker container is very easy and similar to the installation
of Moodle:
</p>
<pre class="example">
mkdir -p /opt/src/
cd /opt/src/
git clone https://github.com/docker-build/shellinabox

mkdir -p /opt/workdir/shell1.example.org
cd /opt/workdir/shell1.example.org
ln -s /opt/src/shellinabox .

cp shellinabox/utils/settings.sh .
vim settings.sh
cp shellinabox/utils/accounts.txt .
vim accounts.txt

shellinabox/docker/build.sh
shellinabox/docker/create.sh
shellinabox/docker/start.sh
shellinabox/config.sh
</pre>

<p>
The file <code>settings.sh</code> should look like this:
</p>
<pre class="example">
### Docker settings.
IMAGE=shellinabox
CONTAINER=shell1-example-org
PORT=
</pre>
<p>
Again, we leave the port empty because we don't any ports to be
exposed by the container, since it is running behind the <i>wsproxy</i>.
To let <i>wsproxy</i> know about handling this domain we use these
commands:
</p>
<pre class="example">
cd /opt/workdir/wsproxy1/
wsproxy/domains-add.sh shell1-example-org shell1.example.org

wsproxy/get-ssl-cert.sh user@gmail.com shell1.example.org -t
wsproxy/get-ssl-cert.sh user@gmail.com shell1.example.org
</pre>

<p>
And now we can open in browser: <a href="https://shell1.example.org/">https://shell1.example.org/</a>
</p>
</div>
</div>
