_org/_posts/2017-05-25-single-server.org
* Case Study 3: Installing SchoolTool

SchoolTool is a web based student information system. Installing it is
quite easy and similar to the applications that we have seen above:
#+begin_example
mkdir -p /opt/src/
cd /opt/src/
git clone https://github.com/docker-build/SchoolTool

mkdir -p /opt/workdir/school1.example.org
cd /opt/workdir/school1.example.org/
ln -s /opt/src/SchoolTool .

cp SchoolTool/utils/settings.sh .
vim settings.sh

SchoolTool/docker/build.sh
SchoolTool/docker/create.sh
SchoolTool/docker/start.sh
SchoolTool/config.sh
#+end_example

The configuration file ~settings.sh~ looks like this:
#+begin_example
### docker image and container
IMAGE=schooltool
CONTAINER=school1-example-org
PORTS=

### domain of the site
DOMAIN="school1.example.org"
[ . . . . . ]
#+end_example
Here again we leave the PORTS empty because we don't want the
container to expose the http ports. To let /wsproxy/ know about
handling this domain we use these commands:
#+begin_example
cd /opt/workdir/wsproxy1/
wsproxy/domains-add.sh school1-example-org school1.example.org

wsproxy/get-ssl-cert.sh user@gmail.com school1.example.org -t
wsproxy/get-ssl-cert.sh user@gmail.com school1.example.org
#+end_example

The latest stable version of SchoolTool depends on /ubuntu-14.04/,
while the rest of the applications that we have seen depend on
/ubuntu-16.04/.  This makes it impossible to install it on the same
server with the others, unless virtual machines or Docker are
used. This illustrates again the advantage of using /wsproxy/ and
docker containers for installing all the applications on the same
server.


* Managing Your Own Domain Name Server

The sites or webapps that we have installed on our server each one has
its own domain or subdomain. Nowadays domains and subdomains are
managed by service providers and everything is done from a nice web
interface. However we will see in this section that it is not
difficult to manage our domains with our server. But of course you
need to know first some basic concepts about how DNS works.

I have also built some scripts that make it even easier. These scripts
install *bind9* inside a docker container and configure it as a
*hidden*, *master*, *authoritative-only* DNS server.

*Hidden* means that it stays behind a firewall, not accessible from
the outside world. *Master* or *primary* means that it is a primary
source of information for the domains that it provides. There are also
*slave/secondary* DNS servers, which get the information of the
domains that they cover from other (master/primary) servers. If we
update the domain on a master server, the slaves will synchronize with
it automatically after a certain time.

*Authoritative-only* means that the server will just give answers for
the domains that it masters, and nothing else. DNS servers can
possibly do several things, for example give answers to DNS requests
from clients, both for the domains that they are responsible for and
for other domains. If they don’t know the answer, they get it from the
Internet, fetch it to the client and then cache it for future
requests. However this server does not do any of these things. It just
answers for its own domains.

But there is a catch here: if the server stays behind the firewall,
hidden from the world and does not accept any requests from clients,
where should the clients send queries about our domain? The answer is
that they will query some slave/secondary DNS servers which are
synchronized with our server. Fortunately there are lots of free
secondary DNS services out there:
http://networking.ringofsaturn.com/Unix/freednsservers.php

Before continuing with the rest of installation/configuration,
register your domain(s) on two or more secondary servers.  For example
I have used /puck.nether.net/ and /buddyns.com/.

Next get the scripts:
#+begin_example
cd /opt/workdir/
git clone https://github.com/docker-build/bind9
cd bind9/
#+end_example

Then modify ~config/etc/bind/named.conf.local~ to look like this:
#+begin_example
zone "example.org" {
        type master;
        also-notify {
                173.244.206.26;     # a.transfer.buddyns.com
                88.198.106.11;      # b.transfer.buddyns.com
                204.42.254.5;       # puck.nether.net
        };
        file "/var/cache/bind/db.example.org";
};
#+end_example
Of course, you can use some slave DNS servers different from
/buddyns.com/ and /puck.nether.net/ (and the corresponding IPs). Fix
the IPs of the slave DNS servers also on
~config/etc/bind/named.conf.options~ and on ~ufw.sh~.

Now create a file like ~config/var/cache/bind/db.example.org~ with a
content like this:

#+begin_example
 ; example.org
 $TTL    24h
 $ORIGIN example.org.
 @       1D      IN      SOA     ns1.example.org.    admin.example.org. (
                                         2017063001 ; serial
                                         3H ; refresh
                                         15m ; retry
                                         1w ; expire
                                         2h ; minimum
                                 )
                 IN      NS              b.ns.buddyns.com.
                 IN      NS              c.ns.buddyns.com.
                 IN      NS              puck.nether.net.

                 IN      MX      10      aspmx.l.google.com.

 ; server host definitions
 ns1.example.org.  IN  A                 12.345.67.89
 @               IN      A               12.345.67.89

 ; point to the server any subdomain
 *               IN      A               12.345.67.89

 mail            IN      CNAME           ghs.google.com.
#+end_example

You can see that only the secondary servers are listed as nameservers
for our domain. So, when clients have any questions about our domain,
they go and ask them, not our server (which is behind a firewall and
cannot be reached). Also don’t forget to change the serial number whenever
this file is modified, otherwise the changes may not be noticed and
propagated on the Internet.

For managing another domain, we should add another zone at
~config/etc/bind/named.conf.local~ and another db file at
~config/var/cache/bind/~.

Once we are done with the config files, we can give =./build.sh= and
=./run.sh= and the /bind9/ container will be up and running. In case
that configuration files need to be changed, update them and rebuild
the container by running: =./rm.sh && ./build.sh && ./run.sh=


* Conclusion

We have seen that it is quite possible to install several websites,
webapps etc. in the same server. Using Docker makes it more efficient,
more robust and easier to install and maintain them. This is due to
the nice features of Docker, like having a small overhead, sharing
resources, flexibility in configuration, being scriptable etc. We have
also seen that using a bunch of small shell scripts with Docker goes a
long way towards making the installation and maintenance of such a
server very easy.


* Future Work

- Improving the docker scripts that are used to install and manage web
  applications mentioned in this article (Moodle, SchoolTool,
  Shellinabox, etc.)
- Developing docker scripts for more applications that can be useful
  for schools, universities, organizations, institutions, small
  businesses, etc.


