_posts/2017-05-25-single-server.html


<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">11</span> Case Study 3: Installing SchoolTool</h2>
<div class="outline-text-2" id="text-11">
<p>
SchoolTool is a web based student information system. Installing it is
quite easy and similar to the applications that we have seen above:
</p>
<pre class="example">
mkdir -p /opt/src/
cd /opt/src/
git clone https://github.com/docker-build/SchoolTool

mkdir -p /opt/workdir/school1.example.org
cd /opt/workdir/school1.example.org/
ln -s /opt/src/SchoolTool .

cp SchoolTool/utils/settings.sh .
vim settings.sh

SchoolTool/docker/build.sh
SchoolTool/docker/create.sh
SchoolTool/docker/start.sh
SchoolTool/config.sh
</pre>

<p>
The configuration file <code>settings.sh</code> looks like this:
</p>
<pre class="example">
### docker image and container
IMAGE=schooltool
CONTAINER=school1-example-org
PORTS=

### domain of the site
DOMAIN="school1.example.org"
[ . . . . . ]
</pre>
<p>
Here again we leave the PORTS empty because we don't want the
container to expose the http ports. To let <i>wsproxy</i> know about
handling this domain we use these commands:
</p>
<pre class="example">
cd /opt/workdir/wsproxy1/
wsproxy/domains-add.sh school1-example-org school1.example.org

wsproxy/get-ssl-cert.sh user@gmail.com school1.example.org -t
wsproxy/get-ssl-cert.sh user@gmail.com school1.example.org
</pre>

<p>
The latest stable version of SchoolTool depends on <i>ubuntu-14.04</i>,
while the rest of the applications that we have seen depend on
<i>ubuntu-16.04</i>.  This makes it impossible to install it on the same
server with the others, unless virtual machines or Docker are
used. This illustrates again the advantage of using <i>wsproxy</i> and
docker containers for installing all the applications on the same
server.
</p>
</div>
</div>


<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">12</span> Managing Your Own Domain Name Server</h2>
<div class="outline-text-2" id="text-12">
<p>
The sites or webapps that we have installed on our server each one has
its own domain or subdomain. Nowadays domains and subdomains are
managed by service providers and everything is done from a nice web
interface. However we will see in this section that it is not
difficult to manage our domains with our server. But of course you
need to know first some basic concepts about how DNS works.
</p>

<p>
I have also built some scripts that make it even easier. These scripts
install <b>bind9</b> inside a docker container and configure it as a
<b>hidden</b>, <b>master</b>, <b>authoritative-only</b> DNS server.
</p>

<p>
<b>Hidden</b> means that it stays behind a firewall, not accessible from
the outside world. <b>Master</b> or <b>primary</b> means that it is a primary
source of information for the domains that it provides. There are also
<b>slave/secondary</b> DNS servers, which get the information of the
domains that they cover from other (master/primary) servers. If we
update the domain on a master server, the slaves will synchronize with
it automatically after a certain time.
</p>

<p>
<b>Authoritative-only</b> means that the server will just give answers for
the domains that it masters, and nothing else. DNS servers can
possibly do several things, for example give answers to DNS requests
from clients, both for the domains that they are responsible for and
for other domains. If they don’t know the answer, they get it from the
Internet, fetch it to the client and then cache it for future
requests. However this server does not do any of these things. It just
answers for its own domains.
</p>

<p>
But there is a catch here: if the server stays behind the firewall,
hidden from the world and does not accept any requests from clients,
where should the clients send queries about our domain? The answer is
that they will query some slave/secondary DNS servers which are
synchronized with our server. Fortunately there are lots of free
secondary DNS services out there:
<a href="http://networking.ringofsaturn.com/Unix/freednsservers.php">http://networking.ringofsaturn.com/Unix/freednsservers.php</a>
</p>

<p>
Before continuing with the rest of installation/configuration,
register your domain(s) on two or more secondary servers.  For example
I have used <i>puck.nether.net</i> and <i>buddyns.com</i>.
</p>

<p>
Next get the scripts:
</p>
<pre class="example">
cd /opt/workdir/
git clone https://github.com/docker-build/bind9
cd bind9/
</pre>

<p>
Then modify <code>config/etc/bind/named.conf.local</code> to look like this:
</p>
<pre class="example">
zone "example.org" {
        type master;
        also-notify {
                173.244.206.26;     # a.transfer.buddyns.com
                88.198.106.11;      # b.transfer.buddyns.com
                204.42.254.5;       # puck.nether.net
        };
        file "/var/cache/bind/db.example.org";
};
</pre>
<p>
Of course, you can use some slave DNS servers different from
<i>buddyns.com</i> and <i>puck.nether.net</i> (and the corresponding IPs). Fix
the IPs of the slave DNS servers also on
<code>config/etc/bind/named.conf.options</code> and on <code>ufw.sh</code>.
</p>

<p>
Now create a file like <code>config/var/cache/bind/db.example.org</code> with a
content like this:
#+begin_example
; example.org
$TTL    24h
$ORIGIN example.org.
@       1D      IN      SOA     ns1.example.org.    admin.example.org. (
                                        2017063001 ; serial
                                        3H ; refresh
                                        15m ; retry
                                        1w ; expire
                                        2h ; minimum
                                )
                IN      NS              b.ns.buddyns.com.
                IN      NS              c.ns.buddyns.com.
                IN      NS              puck.nether.net.
</p>

<p>
IN      MX      10      aspmx.l.google.com.
</p>

<p>
; server host definitions
ns1.example.org.  IN  A                 12.345.67.89
@               IN      A               12.345.67.89
</p>

<p>
; point to the server any subdomain
</p>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">13</span> IN      A               12.345.67.89</h2>
<div class="outline-text-2" id="text-13">
<p>
mail            IN      CNAME           ghs.google.com.
#+end_example
</p>

<p>
You can see that only the secondary servers are listed as nameservers
for our domain. So, when clients have any questions about our domain,
they go and ask them, not our server (which is behind a firewall and
cannot be reached). Also don’t forget to change the serial number whenever
this file is modified, otherwise the changes may not be noticed and
propagated on the Internet.
</p>

<p>
For managing another domain, we should add another zone at
<code>config/etc/bind/named.conf.local</code> and another db file at
<code>config/var/cache/bind/</code>.
</p>

<p>
Once we are done with the config files, we can give <code>./build.sh</code> and
<code>./run.sh</code> and the <i>bind9</i> container will be up and running. In case
that configuration files need to be changed, update them and rebuild
the container by running: <code>./rm.sh &amp;&amp; ./build.sh &amp;&amp; ./run.sh</code>
</p>
</div>
</div>


<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">14</span> Conclusion</h2>
<div class="outline-text-2" id="text-14">
<p>
We have seen that it is quite possible to install several websites,
webapps etc. in the same server. Using Docker makes it more efficient,
more robust and easier to install and maintain them. This is due to
the nice features of Docker, like having a small overhead, sharing
resources, flexibility in configuration, being scriptable etc. We have
also seen that using a bunch of small shell scripts with Docker goes a
long way towards making the installation and maintenance of such a
server very easy.
</p>
</div>
</div>


<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">15</span> Future Work</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>Improving the docker scripts that are used to install and manage web
applications mentioned in this article (Moodle, SchoolTool,
Shellinabox, etc.)</li>
<li>Developing docker scripts for more applications that can be useful
for schools, universities, organizations, institutions, small
businesses, etc.</li>
</ul>
</div>
</div>
