_org/_posts/2017-05-25-single-server.org
* References

- https://docs.docker.com/
- https://github.com/docker-build/wsproxy
- https://letsencrypt.org/docs/
- https://docs.moodle.org/
- http://schooltool.org/
- https://www.tecmint.com/shell-in-a-box-a-web-based-ssh-terminal-to-access-remote-linux-servers/
- https://blog.lundscape.com/2009/05/configure-a-reverse-proxy-with-apache/
- http://blogs.adobe.com/cguerrero/2010/10/27/configuring-a-reverse-proxy-with-apache-that-handles-https-connections/
- https://help.ubuntu.com/lts/serverguide/dns-configuration.html
- http://wernerstrydom.com/2013/02/23/configuring-ubuntu-server-12-04-as-dns-server/
