_posts/2017-05-25-single-server.html


<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">16</span> References</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li><a href="https://docs.docker.com/">https://docs.docker.com/</a></li>
<li><a href="https://github.com/docker-build/wsproxy">https://github.com/docker-build/wsproxy</a></li>
<li><a href="https://letsencrypt.org/docs/">https://letsencrypt.org/docs/</a></li>
<li><a href="https://docs.moodle.org/">https://docs.moodle.org/</a></li>
<li><a href="http://schooltool.org/">http://schooltool.org/</a></li>
<li><a href="https://www.tecmint.com/shell-in-a-box-a-web-based-ssh-terminal-to-access-remote-linux-servers/">https://www.tecmint.com/shell-in-a-box-a-web-based-ssh-terminal-to-access-remote-linux-servers/</a></li>
<li><a href="https://blog.lundscape.com/2009/05/configure-a-reverse-proxy-with-apache/">https://blog.lundscape.com/2009/05/configure-a-reverse-proxy-with-apache/</a></li>
<li><a href="http://blogs.adobe.com/cguerrero/2010/10/27/configuring-a-reverse-proxy-with-apache-that-handles-https-connections/">http://blogs.adobe.com/cguerrero/2010/10/27/configuring-a-reverse-proxy-with-apache-that-handles-https-connections/</a></li>
<li><a href="https://help.ubuntu.com/lts/serverguide/dns-configuration.html">https://help.ubuntu.com/lts/serverguide/dns-configuration.html</a></li>
<li><a href="http://wernerstrydom.com/2013/02/23/configuring-ubuntu-server-12-04-as-dns-server/">http://wernerstrydom.com/2013/02/23/configuring-ubuntu-server-12-04-as-dns-server/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-05-25</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2017-06-02 Fri 14:06</p>
<p class="validation"></p>
</div>
</body>
</html>
